ProgessBase/Documents/ПРГ_МодернизацияОС_МСФО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПРГ_МодернизацияОС_МСФО</Name>
			<BasedOn>
				<xr:Item>Document.МодернизацияОС</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОсновныеСредстваМеждународныйУчет</xr:Item>
				<xr:Item>AccountingRegister.Международный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументМодернизацииРСБУ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.МодернизацияОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

ProgessBase/InformationRegisters/ОсновныеСредстваМеждународныйУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеСредстваМеждународныйУчет</Name>
			<Comment>(Упр) Сведения об объектах ОС  для целей международного учета</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, на балансе которой учитывется объект ОС в международном учете</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПринятияКУчету</Name>
					<Comment>Дата принятия объекта к международному учету</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестонахождениеОбъекта</Name>
					<Comment>Подразделение организации, в котором находится объект ОС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСостоянийОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчета</Name>
					<Comment>Счет учета в плане счетов Международный</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Comment>Срок полезного использования в месяцах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Comment>Булево - начиляется амортизация или нет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодНачисленияАмортизации</Name>
					<Comment>Метод начисления амортизации по международному учету</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.МетодыНачисленияАмортизацииОСМеждународный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизации</Name>
					<Comment>Счет, на котором накапливается начисленная амортизация</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная (историческая) стоимость объекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СправедливаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Comment>Стоимость, которая должна остаться после истечения срока полезного использования</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Comment>Счет учета, в дебет которого относятся амортизационные отчисления</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто1</Name>
					<Comment>Субконто первого уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто2</Name>
					<Comment>Субконто второго уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субконто3</Name>
					<Comment>Субконто третьего уровня счета, в дебет которого относится амортизация</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ВидыСубконтоМеждународные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредполагаемыйОбъемПродукции</Name>
					<Comment>Используется при амортизации пропорционально объему продукции</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНачисленнойАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>13</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УбытокОтОбесценения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСниженияСтоимости</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Международный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ис_Лизинг</Name>
					<Comment>ОС находится в лизинге</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/AccountingRegisters/Международный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Международный</Name>
			<Comment>(Упр)</Comment>
			<ChartOfAccounts>ChartOfAccounts.Международный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Международный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Международный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЖурнала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПервичныйНомерСтроки</Name>
					<Comment>Необходим для переноса затрат</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаДт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_ПравилоПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаСоответствияСчетовБУиМСФО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ис_НомерСтрокиПравилаПереносаКт</Name>
					<Comment>Для анализа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

ProgessBase/Documents/ПРГ_МодернизацияОС_МСФО/Ext/ObjectModule.bsl
Перем мУдалятьДвижения Экспорт;

Перем мТЗИнформация Экспорт;


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.МодернизацияОС") Тогда
		ДокументМодернизацииРСБУ = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ДвиженияОснования = ДокументМодернизацииРСБУ.ПолучитьОбъект().Движения;
	
	ДвиженияПоРегиструБухгалтерииМеждународный(Отказ, ДвиженияОснования);
	
	ДвиженияПоРегиструОсновныеСредстваМеждународный(Отказ, ДвиженияОснования);
		
КонецПроцедуры


Процедура ДвиженияПоРегиструОсновныеСредстваМеждународный(Отказ, ДвиженияОснования)
	
	ДвиженияОснованияПараметрыАмортизации 	= ДвиженияОснования.ПараметрыАмортизацииОСБухгалтерскийУчет;
	ДвиженияОснованияСтоимость 				= ДвиженияОснования.СтоимостьОСБухгалтерскийУчет;
	ДвиженияОснованияПараметрыАмортизации	.Прочитать();
	ДвиженияОснованияСтоимость				.Прочитать();
	
	ДвиженияОснованияПараметрыАмортизации 	= ДвиженияОснованияПараметрыАмортизации.Выгрузить();
	ДвиженияОснованияСтоимость 				= ДвиженияОснованияСтоимость.Выгрузить();
	
	Движения.ОсновныеСредстваМеждународныйУчет.Записывать = Истина;
	
	Для Каждого ОССтрока Из ДокументМодернизацииРСБУ.ОС Цикл
		
		ОС = ОССтрока.ОсновноеСредство;
		
		СтоимостьМодернизации = 0;
		СтоимостьСтрока = ДвиженияОснованияСтоимость.Найти(ОС, "ОсновноеСредство");
		Если СтоимостьСтрока <> Неопределено Тогда
			СтоимостьМодернизации = ? (СтоимостьСтрока.ВидДвижения = ВидДвиженияНакопления.Приход, СтоимостьСтрока.Стоимость, - СтоимостьСтрока.Стоимость);
		КонецЕсли;
		
		ДатаДвижения = ДокументМодернизацииРСБУ.Дата;
		ДанныеРегистра = РегистрыСведений.ОсновныеСредстваМеждународныйУчет.ПолучитьПоследнее(ДатаДвижения, Новый Структура("ОсновноеСредство", ОС));
		
		Движение = Движения.ОсновныеСредстваМеждународныйУчет.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ДанныеРегистра);
		Движение.Период 					= ДатаДвижения;
		Движение.ОсновноеСредство 			= ОС;
		Движение.ПервоначальнаяСтоимость 	= Движение.ПервоначальнаяСтоимость + СтоимостьМодернизации;
		Движение.СправедливаяСтоимость 		= Движение.СправедливаяСтоимость + СтоимостьМодернизации;
		
		НовыйСрок = ДанныеРегистра.СрокПолезногоИспользования + ОССтрока.СрокПолезногоИспользованияБУ - ОССтрока.ФактСрокИспользованияБУ;
		Если ТипЗнч(мТЗИнформация) = Тип("ТаблицаЗначений") И мТЗИнформация.Количество() > 0 Тогда
			СтрокаТЗ = мТЗИнформация.Найти(ОС, "ОС");
			Если СтрокаТЗ <> Неопределено И СтрокаТЗ.СПИСтал <> НовыйСрок Тогда
				НовыйСрок = СтрокаТЗ.СПИСтал;
			КонецЕсли;
		КонецЕсли;
		
		Движение.СрокПолезногоИспользования = НовыйСрок;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ДвиженияПоРегиструБухгалтерииМеждународный(Отказ, ДвиженияОснования)
	
	ДвиженияОснованияХозрасчетный = ДвиженияОснования.Хозрасчетный;
	ДвиженияОснованияХозрасчетный.Прочитать();
	
	Движения.Международный.Записывать = Истина;
	
	Для Каждого ДвижениеРСБУ Из ДвиженияОснованияХозрасчетный Цикл
		
		Движение = Движения.Международный.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, ДвижениеРСБУ, "Период, Организация, Содержание, НомерЖурнала, КоличествоДт, КоличествоКт, Сумма");
		
		СтруктураМСФО = МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ДвижениеРСБУ.СчетДт, ДвижениеРСБУ.СубконтоДт[0], ДвижениеРСБУ.СубконтоДт[1], ДвижениеРСБУ.СубконтоДт[2], Дата, , Истина);
		Если Не ЗначениеЗаполнено(СтруктураМСФО.Счет) Тогда
			Движение.СчетДт = ПланыСчетов.Международный.НайтиПоКоду(ДвижениеРСБУ.СчетДт.Код);
		Иначе
			Движение.СчетДт = СтруктураМСФО.Счет;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Движение.СчетДт) Тогда
			Для Каждого КлючЗначение Из ДвижениеРСБУ.СубконтоДт Цикл
				Для Н = 0 По Движение.СчетДт.ВидыСубконто.Количество()-1 Цикл
					ВидСубконто = Движение.СчетДт.ВидыСубконто[Н].ВидСубконто;
					Если ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(КлючЗначение.Значение)) Тогда
						Движение.СубконтоДт[ВидСубконто] = КлючЗначение.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("В строке %1 не определено соответствие для счета дебета %2", ДвижениеРСБУ.НомерСтроки, ДвижениеРСБУ.СчетДт);
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
			Отказ = Истина;
		КонецЕсли;
		
		СтруктураМСФО = МеждународныйУчет.ПреобразоватьСчетаБУвСчетМСФО(ДвижениеРСБУ.СчетКт, ДвижениеРСБУ.СубконтоКт[0], ДвижениеРСБУ.СубконтоКт[1], ДвижениеРСБУ.СубконтоКт[2], Дата, , Истина);
		Если Не ЗначениеЗаполнено(СтруктураМСФО.Счет) Тогда
			Движение.СчетКт = ПланыСчетов.Международный.НайтиПоКоду(ДвижениеРСБУ.СчетКт.Код);
		Иначе
			Движение.СчетКт = СтруктураМСФО.Счет;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Движение.СчетКт) Тогда
			Для Каждого КлючЗначение Из ДвижениеРСБУ.СубконтоКт Цикл
				Для Н = 0 По Движение.СчетКт.ВидыСубконто.Количество()-1 Цикл
					ВидСубконто = Движение.СчетКт.ВидыСубконто[Н].ВидСубконто;
					Если ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(КлючЗначение.Значение)) Тогда
						Движение.СубконтоКт[ВидСубконто] = КлючЗначение.Значение;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("В строке %1 не определено соответствие для счета кредита %2", ДвижениеРСБУ.НомерСтроки, ДвижениеРСБУ.СчетДт);
			ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения);
			Отказ = Истина;			
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры
